app/views/posts/show.html.slim


  = render partial: '/comments/comment',
    collection: @post.comments.where(ancestry: nil).order(created_at: :desc).to_a
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? AND "post_comments"."ancestry" IS NULL ORDER BY "post_comments"."created_at" DESC  [["post_id", 538806297]]