app/controllers/comments_controller.rb

  def create
    post = Post.find(params[:post_id])
    @comment = current_user.comments.build(comment_params)
    @comment.post = post

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 647284951], ["LIMIT", 1]]
INSERT INTO "post_comments" ("content", "post_id", "user_id", "created_at", "updated_at", "ancestry") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["content", "MyString"], ["post_id", 647284951], ["user_id", 980190962], ["created_at", "2025-04-01 10:04:09.500404"], ["updated_at", "2025-04-01 10:04:09.500404"], ["ancestry", nil]]

  def destroy
    comment = PostComment.find(params[:id])
    return if comment.user != current_user

    post = comment.post
    comment.destroy
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 980190962]]