app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 647284951], ["LIMIT", 1]]
INSERT INTO "post_likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["post_id", 647284951], ["user_id", 298486374], ["created_at", "2025-04-01 10:04:09.511739"], ["updated_at", "2025-04-01 10:04:09.511739"]]
SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = ? AND "post_likes"."user_id" = ? LIMIT ?  [["post_id", 647284951], ["user_id", 298486374], ["LIMIT", 1]]
---
  def create
    post = Post.find(params[:post_id])
    post.likes.find_or_create_by(user: current_user)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 647284951], ["LIMIT", 1]]
DELETE FROM "post_likes" WHERE "post_likes"."id" = ?  [["id", 270817253]]
SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = ? AND "post_likes"."user_id" = ? LIMIT ?  [["post_id", 647284951], ["user_id", 980190962], ["LIMIT", 1]]
---
  def destroy
    post = Post.find(params[:post_id])
    post.likes.find_by(user: current_user)&.destroy