app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:category, :creator).order(created_at: :desc)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 298486374], ["id", 980190962]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "creator_id", "category_id", "post_likes_count") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ?, "category_id" = ? WHERE "posts"."id" = ?  [["updated_at", "2025-04-01 10:04:09.470948"], ["category_id", 980190962], ["id", 538806297]]

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 538806297]]

  def set_post_with_comments
    @post = Post
            .joins(:category, :creator)
            .includes(:likes, comments: :user)
            .find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 298486374], ["id", 980190962]]